eisup_2019_docmng_integration/src/Documents/абс_ЗагрузкаДанныхИзБоссКадровик/абс_ЗагрузкаДанныхИзБоссКадровик.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>абс_ЗагрузкаДанныхИзБоссКадровик</name>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗагружатьПоКТТК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ФизическиеЛица</name>
    <attributes>
      <name>Фл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодФизЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>900</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Сотрудники</name>
    <attributes>
      <name>Фл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>КодФизЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Фамилия</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Отчество</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>КодДолжности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеДолжности</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодПодразделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеПодразделения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодЦФО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаименованиеЦФО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Грейд</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПриема</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУвольнения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаНазначения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаЗавершенияНазначения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Должность</name>
      <type>
        <types>CatalogRef.ДолжностиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогинОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>900</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЦФО</name>
    <attributes>
      <name>Фл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЦФОСсылка</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Подразделения</name>
    <attributes>
      <name>Фл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Код</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наименование</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСоздания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаРасформирования</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>КодРодителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Родитель</name>
      <type>
        <types>CatalogRef.ПодразделенияОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>900</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Организация</name>
      <type>
        <types>CatalogRef.Организации</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Пользователи</name>
    <attributes>
      <name>Фл</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ФизЛицо</name>
      <type>
        <types>CatalogRef.ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.СотрудникиОрганизаций</types>
      </type>
    </attributes>
    <attributes>
      <name>ПолноеИмяПользователя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяДомена</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЛогинОС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Описание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>900</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

eisup_2019_docmng_integration/src/InformationRegisters/ФИОФизЛиц/ФИОФизЛиц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ФИОФизЛиц</name>
  <comment>(Общ)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Фамилия</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Имя</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Отчество</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>ФизЛицо</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/ВидыДоговоровСФизЛицами/ВидыДоговоровСФизЛицами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровСФизЛицами</name>
  <enumValues>
    <name>ТрудовойДоговор</name>
  </enumValues>
  <enumValues>
    <name>Подряда</name>
  </enumValues>
  <enumValues>
    <name>Авторский</name>
  </enumValues>
  <enumValues>
    <name>УдалитьЛицензионный</name>
  </enumValues>
  <enumValues>
    <name>ДоговорУправленческий</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/ВидыЗанятостиВОрганизации/ВидыЗанятостиВОрганизации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыЗанятостиВОрганизации</name>
  <comment>(Регл)</comment>
  <enumValues>
    <name>ОсновноеМестоРаботы</name>
  </enumValues>
  <enumValues>
    <name>Совместительство</name>
  </enumValues>
  <enumValues>
    <name>ВнутреннееСовместительство</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Documents/абс_ЗагрузкаДанныхИзБоссКадровик/ObjectModule.bsl
Функция СоздатьФизЛицо(Код,Фамилия,Имя,Отчество) Экспорт
	
	СтруктураВозврата = Новый Структура("ФизЛицо,Описание");
	СтруктураВозврата.Вставить("Описание","");
	Описание = "";
	ФизЛицо = Справочники.ФизическиеЛица.НайтиПоКоду(Код);
	ФИО = Фамилия+" "+Имя+" "+Отчество;
	Если ЗначениеЗаполнено(ФизЛицо) Тогда
		//АБС Заявка 9266 Начало
		Если Найти(""+ФизЛицо,Имя)>0 И Найти(""+ФизЛицо,Отчество)>0 И Найти(""+ФизЛицо,Фамилия)>0 Тогда
			
			//ФизЛицо = справочники.ФизическиеЛица.ПустаяСсылка();
			

		Иначе  //АБС Заявка 9266 Конец
			//Требуется обновить ФИО и сотрудника
			НаборЗаписей = РегистрыСведений.ФИОФизЛиц.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизЛицо.Установить(ФизЛицо.Ссылка);
			НаборЗаписей.Прочитать();
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ФизЛицо = ФизЛицо.Ссылка;
			НоваяЗапись.Фамилия = Фамилия;
			НоваяЗапись.Период = ТекущаяДата();
			НоваяЗапись.Имя = Имя;
			НоваяЗапись.Отчество = Отчество;
			НаборЗаписей.Записать(Истина);
			Об = ФизЛицо.ПолучитьОбъект();
			Об.Наименование = ФИО;
			Об.ОбменДанными.Загрузка = Истина;
			Об.Записать();
			СтруктураВозврата.Вставить("Описание","Изменены ФИО физ.лица "+ФизЛицо+" ");
		КонецЕсли;	
	КонецЕсли;
	Если Не ЗначениеЗаполнено(ФизЛицо) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	ФИОФизЛицСрезПоследних.ФизЛицо
		               |ИЗ
		               |	РегистрСведений.ФИОФизЛиц.СрезПоследних КАК ФИОФизЛицСрезПоследних
		               |ГДЕ
		               |	ФИОФизЛицСрезПоследних.Фамилия = &Фамилия
		               |	И ФИОФизЛицСрезПоследних.Имя = &Имя
		               |	И ФИОФизЛицСрезПоследних.Отчество = &Отчество
		               |	И ФИОФизЛицСрезПоследних.ФизЛицо.Код = &Код";
		Запрос.УстановитьПараметр("Фамилия",Фамилия);
		Запрос.УстановитьПараметр("Имя",Имя);
		Запрос.УстановитьПараметр("Отчество",Отчество);
		Запрос.УстановитьПараметр("Код",Код);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			СтруктураВозврата.Вставить("ФизЛицо",Выборка.ФизЛицо);
			СтруктураВозврата.Вставить("Описание","");
		Иначе
			НовыйФЛ = Справочники.ФизическиеЛица.СоздатьЭлемент();
			НовыйФЛ.Код = СокрЛП(Код);
			НовыйФЛ.Наименование = Фамилия+" "+Имя+" "+Отчество;
			НовыйФЛ.Записать();
			
			НайденноеФизЛицо = НовыйФЛ.Ссылка;
			НаборЗаписей = РегистрыСведений.ФИОФизЛиц.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ФизЛицо.Установить(НайденноеФизЛицо);
			НаборЗаписей.Прочитать();
			НоваяЗапись = НаборЗаписей.Добавить();
			НоваяЗапись.ФизЛицо = НайденноеФизЛицо;
			НоваяЗапись.Фамилия = Фамилия;
			НоваяЗапись.Период = '198001010000';
			НоваяЗапись.Имя = Имя;
			НоваяЗапись.Отчество = Отчество;
			НаборЗаписей.Записать(Истина);
			СтруктураВозврата.Вставить("ФизЛицо",НайденноефизЛицо);
			СтруктураВозврата.Вставить("Описание","#Создано физ. лицо "+НайденноеФизЛицо+" с кодом "+Код+" под пользователем "+ГлЗначениеПеременной("ГлТекущийПользователь")+" время создания "+ТекущаяДата()+""+Символы.ПС);
			
		КонецЕсли;
		
	Иначе
		СтруктураВозврата.Вставить("ФизЛицо",ФизЛицо.Ссылка);
	КонецЕсли;
	
	Возврат СтруктураВозврата;
КонецФункции



Функция СоздатьПодразделение(Код,Наименование,КодРодителя,Организация) Экспорт
	
	СтруктураВозврата = Новый Структура("Подразделение,Описание");
	СтруктураВозврата.Вставить("Подразделение",Справочники.ПодразделенияОрганизаций.ПустаяСсылка());
	СтруктураВозврата.Вставить("Описание","");
	
	Если ЗначениеЗаполнено(КодРодителя) Тогда
		Родитель = Справочники.ПодразделенияОрганизаций.НайтиПоКоду(КодРодителя);
		//Если Не ЗначениеЗаполнено(Родитель) Тогда
		//	СтрокаРодителя = Подразделения.Найти(КодРодителя,"Код");
		//	Если СтрокаРодителя<> Неопределено Тогда
		//		Родитель = СоздатьПодразделение(КодРодителя,СтрокаРодителя.Наименование,СтрокаРодителя.КодРодителя);
		//	Иначе Родитель = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
		//	КонецЕсли;
		//	
		//КонецЕсли;
	Иначе
		Родитель = Справочники.ПодразделенияОрганизаций.ПустаяСсылка();
	КонецЕсли;
	
	
	Подразделение = Справочники.ПодразделенияОрганизаций.НайтиПоКоду(Код);
	
	Если Не ЗначениеЗаполнено(Подразделение) И ЗначениеЗаполнено(Организация) Тогда
		
		НовоеПодразделение = Справочники.ПодразделенияОрганизаций.СоздатьЭлемент();
		НовоеПодразделение.Код = СокрЛП(Код);
		НовоеПодразделение.Владелец = Организация;
		НовоеПодразделение.Наименование = Наименование;
		Если ЗначениеЗаполнено(Родитель) Тогда
			НовоеПодразделение.Родитель = Родитель;
		КонецЕсли;
		НовоеПодразделение.ОбменДанными.Загрузка = Истина;
		НовоеПодразделение.Записать();
		СтруктураВозврата.Вставить("Описание","#Создано подразделение "+НовоеПодразделение.Ссылка+" с кодом "+Код+" под пользователем "+ГлЗначениеПеременной("ГлТекущийПользователь")+" время создания "+ТекущаяДата()+""+Символы.ПС);
		Подразделение = НовоеПодразделение.Ссылка;
		СтруктураВозврата.Вставить("Подразделение",Подразделение);
		
	Иначе 
		Если ЗначениеЗаполнено(Подразделение) Тогда
			СтруктураВозврата.Вставить("Подразделение",Подразделение);
		КонецЕсли;
	КонецЕсли;
	
	Возврат СтруктураВозврата;
	
КонецФункции


Функция СоздатьСотрудника(СтрокаТабличнойЧасти) Экспорт
	
	СтруктураВозврата = Новый Структура("Сотрудник,Описание");
	СтруктураВозврата.Вставить("Описание","");
	СтруктураВозврата.Вставить("Сотрудник",Справочники.СотрудникиОрганизаций.ПустаяСсылка());
	
	Если Не ЗначениеЗаполнено(СтрокаТабличнойЧасти.Должность) Тогда
		СтрокаТабличнойЧасти.Должность = СоздатьДолжность(СтрокаТабличнойЧасти.КодДолжности,СтрокаТабличнойЧасти.НаименованиеДолжности);
	КонецЕсли;
	
	
	
	Если ЗначениеЗАполнено(СтрокаТабличнойЧасти.ФизЛицо) И ЗначениеЗаполнено(СтрокаТабличнойЧасти.Подразделение)  Тогда
		
		НовыйСотрудник = Справочники.СотрудникиОрганизаций.СоздатьЭлемент();
		НовыйСотрудник.Наименование = СтрокаТабличнойЧасти.ФизЛицо;
		
		
		НовыйСотрудник = Справочники.СотрудникиОрганизаций.СоздатьЭлемент();
		НовыйСотрудник.Актуальность=Истина;
		
		НовыйСотрудник.Физлицо = СтрокаТабличнойЧасти.ФизЛицо;
		НовыйСотрудник.Код = СокрЛП(СтрокаТабличнойЧасти.Код);
		НовыйСотрудник.Наименование =""+СтрокаТабличнойЧасти.ФизЛицо;
		НовыйСотрудник.ДатаПриемаНаРаботу = СтрокаТабличнойЧасти.ДатаПриема;
		НовыйСотрудник.ПодразделениеОрганизации = СтрокаТабличнойЧасти.Подразделение;
		НовыйСотрудник.Должность =   СтрокаТабличнойЧасти.Должность;
		НовыйСотрудник.ОбособленноеПодразделение = СтрокаТабличнойЧасти.Подразделение.Владелец;
		НовыйСотрудник.Организация = СтрокаТабличнойЧасти.Подразделение.Владелец;
		НовыйСотрудник.ВидДоговора = Перечисления.ВидыДоговоровСФизЛицами.ТрудовойДоговор;
		НовыйСотрудник.ВидЗанятости = Перечисления.ВидыЗанятостиВОрганизации.ОсновноеМестоРаботы;
		НовыйСотрудник.Записать();
		СтруктураВозврата.Вставить("Сотрудник",НовыйСотрудник.Ссылка);
		СтруктураВозврата.Вставить("Описание","#Создан сотрудник "+НовыйСотрудник.Ссылка+" с кодом "+СтрокаТабличнойЧасти.Код+" под пользователем "+ГлЗначениеПеременной("ГлТекущийПользователь")+" время создания "+ТекущаяДата()+""+Символы.ПС);
		СформироватьПриемНаРаботу(НовыйСотрудник.Ссылка,СтрокаТабличнойЧасти.Подразделение,СтрокаТабличнойЧасти.Должность,Неопределено);
	КонецЕсли;
	
	Возврат СтруктураВозврата;	
КонецФункции

Функция СоздатьДолжность(Код, Наименование, Обновлять = Ложь)
	
	Должность = Справочники.ДолжностиОрганизаций.НайтиПоКоду(Код);
	
	Если Не ЗначениеЗаполнено(Должность) Тогда
		Должность = Справочники.ДолжностиОрганизаций.НайтиПоНаименованию(Наименование,Истина);
	КонецЕсли;	
	
	ОбновитьТекДолжность = Ложь;
	
	Если Обновлять Тогда
		Если НЕ СокрЛП(Должность.Наименование) = СокрЛП(Наименование) Тогда
			ОбновитьТекДолжность = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Должность) Тогда
		НоваяДолжность = Справочники.ДолжностиОрганизаций.СоздатьЭлемент();
		НоваяДолжность.Наименование = Наименование;
		НоваяДолжность.Код = СокрЛП(Код);
		НоваяДолжность.ОбменДанными.Загрузка = Истина;
		Должность = НоваяДолжность.Ссылка;
	КонецЕсли;
	
	Возврат Должность.Ссылка;
	
КонецФункции

Процедура СоздатьОбновитьДолжности() Экспорт
	
	ТабДолжностей = Сотрудники.Выгрузить(, "Должность,КодДолжности,НаименованиеДолжности");
	
	ТабДолжностей.Свернуть("Должность,КодДолжности,НаименованиеДолжности");
	
	Для Каждого СтрДолжность Из ТабДолжностей Цикл
		
		СтрДолжность.Должность = СоздатьДолжность(СтрДолжность.КодДолжности, СтрДолжность.НаименованиеДолжности, Ложь);
		
		СтрокиСотрПоДолжности = Сотрудники.НайтиСтроки(Новый Структура("КодДолжности", СтрДолжность.КодДолжности));
		
		Для Каждого СтрСотрПоДолжности Из СтрокиСотрПоДолжности Цикл
			
			СтрСотрПоДолжности.Должность = СтрДолжность.Должность;
					
		КонецЦикла;
	КонецЦикла;
		        
КонецПроцедуры

Процедура СформироватьПриемНаРаботу(Сотрудник,Подразделение,Должность,ТЗСотрудники) Экспорт
	
	Если ТЗСотрудники<>Неопределено Тогда
		СтрокаСотрудника = ТЗСотрудники.Найти(Сотрудник,"Сотрудник");
	Иначе
		СтрокаСотрудника = Неопределено;
	КонецЕсли;
	
	Если СтрокаСотрудника<>Неопределено Тогда
		//Проверяем подразделение в документе и в приеме, если отличаются, формируем кадровое перемещение
		мСтароеПодразделение = СтрокаСотрудника.ПодразделениеОрганизации;
		мСтараяДолжность  = СтрокаСотрудника.Должность;
		ИзменилосьПодразделение = Ложь;
		ИзмениласьДолжность = Ложь;
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Если Подразделение<>СтрокаСотрудника.ПодразделениеОрганизации Тогда
				ИзменилосьПодразделение = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Должность) Тогда
			Если Должность<>СтрокаСотрудника.Должность Тогда
				ИзмениласьДолжность = Истина;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(Подразделение) Тогда
			Если ИзменилосьПодразделение ИЛИ ИзмениласьДолжность Тогда
				Док = Документы.КадровоеПеремещениеОрганизаций.СоздатьДокумент();
				Док.Дата = ТекущаяДата();
				Док.Организация = Подразделение.Владелец;
				СтрокаФЛ = Док.ФизическиеЛица.Добавить();
				СтрокаФЛ.ФизическоеЛицо = Сотрудник.ФизЛицо;
				СтрокаРаботника = Док.РаботникиОрганизации.Добавить();
				СтрокаРаботника.Сотрудник = Сотрудник;
				СтрокаРаботника.ФизЛицо  = Сотрудник.ФизЛицо;
				СтрокаРаботника.ЗанимаемыхСтавок=1;
				СтрокаРаботника.ДатаНачала = НачалоДня(ТекущаяДата());
				СтрокаРаботника.ГрафикРаботы =Справочники.ГрафикиРаботы.НайтиПоНаименованию("Пятидневка");
				Если  ИзмениласьДолжность Тогда
					СтрокаРаботника.Должность =Должность;  
					СтрокаСотрудника.Должность =Должность;
				Иначе
					СтрокаРаботника.Должность =СтрокаСотрудника.Должность;
				КонецЕсли;
				Если  ИзменилосьПодразделение Тогда
					СтрокаРаботника.ПодразделениеОрганизации =Подразделение;
					СтрокаСотрудника.ПодразделениеОрганизации =Подразделение;
				Иначе
					СтрокаРаботника.ПодразделениеОрганизации= СтрокаСотрудника.ПодразделениеОрганизации;
				КонецЕсли;
				Попытка
					Док.Записать(РежимЗаписиДокумента.Проведение);
				Исключение
					Док.Записать(РежимЗаписиДокумента.Запись);
				КонецПопытки;
				Сообщить("Записан документ "+Док.Ссылка);
				
			КонецЕсли;
		КонецЕсли;
		
	Иначе
		НовыйПрием = Документы.ПриемНаРаботуВОрганизацию.СоздатьДокумент();
		НовыйПрием.Дата = ТекущаяДата();
		НовыйПрием.Организация = Сотрудник.Организация;
		НоваяСтрока = НовыйПрием.РаботникиОрганизации.Добавить();
		НоваяСтрока.Сотрудник = Сотрудник;
		НоваяСтрока.ФизЛицо = Сотрудник.ФизЛицо;
		НоваяСтрока.ГрафикРаботы = Справочники.ГрафикиРаботы.НайтиПоНаименованию("Пятидневка");
		НоваяСтрока.Должность = Должность;
		НоваяСтрока.ЗанимаемыхСтавок =1;
		НоваяСтрока.ПодразделениеОрганизации = Подразделение;
		НоваяСтрока.ДатаПриема = ?(ЗначениеЗаполнено(Сотрудник.ДатаПриемаНаРаботу),Сотрудник.ДатаПриемаНаРаботу,НачалоГода(ТекущаяДата()));
		Попытка
			НовыйПрием.Записать(РежимЗаписиДокумента.Проведение);
			Если ТЗСотрудники<>Неопределено Тогда
				СтрокаТЗ = ТЗСотрудники.Добавить();
				СтрокаТЗ.Сотрудник = Сотрудник;
				СтрокаТЗ.Должность = Должность;
			КонецЕсли;
			СтрокаТЗ.ПодразделениеОрганизации = Подразделение;
		Исключение
			НовыйПрием.Записать(РежимЗаписиДокумента.Запись);
		КонецПопытки;
		
	КонецЕсли;
	//АБС Заявка 9266
	СотрудникОбъект = Сотрудник.ПолучитьОбъект();
	СотрудникОбъект.ПодразделениеОрганизации = Подразделение;
	СотрудникОбъект.Должность = Должность;
	СотрудникОбъект.Записать();
	
	//АБС Заявка 9266

КонецПроцедуры
